<a href="https://colab.research.google.com/github/EvertonFigueiroa/Exercicios-Python/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Biblioteca para modelagem de dados
import pandas as pd

# Biblioteca para recursos matemáticos
import numpy as np

# Biblioteca para plotagem de dados
import matplotlib.pyplot as plt

In [ ]:
# Biblioteca para modelagem de dados
import pandas as pd

In [ ]:
# Lista com os rotulos
Labels = ['1º', '2º', '3º']

# Lista com os valores
Valores = [10, 20, 30]

# Criando a base de dados com as listas
Serie = pd.Series( data=Valores, index=Labels )
Serie

1º    10
2º    20
3º    30
dtype: int64

In [ ]:
Serie['1º']

10

In [ ]:
Serie * 2

1º    20
2º    40
3º    60
dtype: int64

In [ ]:
Serie_Nova = pd.Series( data=[50,100,150], index=Labels )

Serie + Serie_Nova

1º     60
2º    120
3º    180
dtype: int64

In [ ]:
# Criando um dicionário
Dicionario = {
    'A' : [1, 2, 3],
    'B' : [-3, -2, -1],
    'C' : [0, 10, 20] }

# Criando uma lista com os labels
Label = ['1º Linha', '2º Linha', '3º Linha']

DataFrame_01 = pd.DataFrame( Dicionario, index=Label )
DataFrame_01

          A  B   C
1º Linha  1 -3   0
2º Linha  2 -2  10
3º Linha  3 -1  20

In [ ]:
DataFrame_01['A']

1º Linha    1
2º Linha    2
3º Linha    3
Name: A, dtype: int64

In [ ]:
DataFrame_01[['A', 'B']]

          A  B
1º Linha  1 -3
2º Linha  2 -2
3º Linha  3 -1

In [ ]:
DataFrame_01['Nova_Coluna'] = DataFrame_01['A'] * DataFrame_01['B']
DataFrame_01

          A  B   C  Nova_Coluna
1º Linha  1 -3   0           -3
2º Linha  2 -2  10           -4
3º Linha  3 -1  20           -3

In [ ]:
DataFrame_01.drop('Nova_Coluna', axis=1, inplace=True)
DataFrame_01

          A  B   C
1º Linha  1 -3   0
2º Linha  2 -2  10
3º Linha  3 -1  20

In [ ]:
DataFrame_01.loc['1º Linha']

A    1
B   -3
C    0
Name: 1º Linha, dtype: int64

In [ ]:
DataFrame_01.loc[['1º Linha','3º Linha' ], ['A', 'C']]

          A   C
1º Linha  1   0
3º Linha  3  20

In [ ]:
DataFrame_01.iloc[0:3, 1:]

          B   C
1º Linha -3   0
2º Linha -2  10
3º Linha -1  20

In [ ]:
DataFrame_01 > 0

             A      B      C
1º Linha  True  False  False
2º Linha  True  False   True
3º Linha  True  False   True

In [ ]:
DataFrame_01[ DataFrame_01['A'] > 0 ]['C']

1º Linha     0
2º Linha    10
3º Linha    20
Name: C, dtype: int64

In [ ]:
Filtro = DataFrame_01['C'] > 0
DataFrame_02 = DataFrame_01[Filtro]
DataFrame_02['A']

2º Linha    2
3º Linha    3
Name: A, dtype: int64

In [ ]:
DataFrame_01[
  ( DataFrame_01['A'] > 1 ) & ( DataFrame_01['C'] > 0 )
]

          A  B   C
2º Linha  2 -2  10
3º Linha  3 -1  20

In [ ]:
DataFrame_01.reset_index()

      index  A  B   C
0  1º Linha  1 -3   0
1  2º Linha  2 -2  10
2  3º Linha  3 -1  20

In [ ]:
DataFrame_01

          A  B   C
1º Linha  1 -3   0
2º Linha  2 -2  10
3º Linha  3 -1  20

In [ ]:
# Criando varios dicionarios
Dicionario_01 = {'A' : [1, 2, 3],
                 'B' : [-32, -21, -15],
                 'C' : [60, 10, 20],
                 'Chave' : ['AA', 'BB', 'CC'] }

Dicionario_02 = {'A' : [6, 7, 8],
                 'B' : [-39, -28, -17],
                 'C' : [1000, 10, 60],
                 'Chave' : ['AA', 'BB', 'CC'] }

Dicionario_03 = {'A' : [11, 12, 13],
                 'B' : [-39, -22, -11],
                 'C' : [30, 10, 20],
                 'Chave' : ['AA', 'BB', 'CC'] }

# Criando varias listas para serem os labels
Label_01 = ['1º Linha', '2º Linha', '3º Linha']
Label_02 = ['4º Linha', '5º Linha', '6º Linha']
Label_03 = ['7º Linha', '8º Linha', '9º Linha']

# Estruturando as bases de dados
DataFrame_01 = pd.DataFrame( Dicionario_01, index=Label_01 )
DataFrame_02 = pd.DataFrame( Dicionario_02, index=Label_02 )
DataFrame_03 = pd.DataFrame( Dicionario_03, index=Label_03 )

In [ ]:
pd.concat(
  [ DataFrame_01, DataFrame_02, DataFrame_03 ]
)

           A   B     C Chave
1º Linha   1 -32    60    AA
2º Linha   2 -21    10    BB
3º Linha   3 -15    20    CC
4º Linha   6 -39  1000    AA
5º Linha   7 -28    10    BB
6º Linha   8 -17    60    CC
7º Linha  11 -39    30    AA
8º Linha  12 -22    10    BB
9º Linha  13 -11    20    CC

In [ ]:
pd.merge(
  DataFrame_01, DataFrame_02, how='inner', on='Chave'
)

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [ ]:
# Criando varios dicionarios
Dicionario_01 = {'A' : [1, 2, 3],
                 'B' : [-32, -21, -15],
                 'C' : [60, 10, 20] }

Dicionario_02 = {'D' : [6, 7, 8],
                 'E' : [-39, -28, -17],
                 'F' : [1000, 10, 60] }

# Criando varias listas para serem os labels
Label_01 = ['1º Linha', '2º Linha', '3º Linha']


# Estruturando as bases de dados
DataFrame_01 = pd.DataFrame( Dicionario_01, index=Label_01 )
DataFrame_02 = pd.DataFrame( Dicionario_02, index=Label_01 )

# Aplicando a função join
DataFrame_01.join(DataFrame_02)

          A   B   C  D   E     F
1º Linha  1 -32  60  6 -39  1000
2º Linha  2 -21  10  7 -28    10
3º Linha  3 -15  20  8 -17    60

          A   B   C  D   E     F
1º Linha  1 -32  60  6 -39  1000
2º Linha  2 -21  10  7 -28    10
3º Linha  3 -15  20  8 -17    60

In [ ]:
 Dados = pd.Series( [1,3,5,np.nan,6,8] )
 Dados

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [ ]:
Lista_Datas = pd.date_range('20210101', periods=5)
Lista_Datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
DataFrame_01 = pd.DataFrame( np.random.randn(5,4),
                  index=Lista_Datas,
                  columns=list( ['A','B','C','D']) )
DataFrame_01

                   A         B         C         D
2021-01-01  1.189776 -1.188419  1.221394 -1.727486
2021-01-02  1.836365  0.409810 -0.834335  1.467141
2021-01-03 -0.078459  0.981437  1.063351 -0.071149
2021-01-04 -0.423498 -0.874464 -0.976037 -0.912932
2021-01-05  1.402493  0.885791  0.708346 -1.331700

In [ ]:
Dicionario = {
    'A' : 1,
    'B' : pd.Timestamp('20210102'),
    'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
    'D' : np.array([3] * 4, dtype='int32'),
    'E' : pd.Categorical( ["Email", "Telefone", "Celular", "País"] ),
    'F' : pd.Categorical( ["email@.email.com", "(11)4455-4455", "(11)922332233", "Brasil"] ),
}

DataFrame_02 = pd.DataFrame( Dicionario )
DataFrame_02

   A          B    C  D         E                 F
0  1 2021-01-02  1.0  3     Email  email@.email.com
1  1 2021-01-02  1.0  3  Telefone     (11)4455-4455
2  1 2021-01-02  1.0  3   Celular     (11)922332233
3  1 2021-01-02  1.0  3      País            Brasil

In [ ]:
DataFrame_02.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F          category
dtype: object

In [ ]:
DataFrame_02.head()

   A          B    C  D         E                 F
0  1 2021-01-02  1.0  3     Email  email@.email.com
1  1 2021-01-02  1.0  3  Telefone     (11)4455-4455
2  1 2021-01-02  1.0  3   Celular     (11)922332233
3  1 2021-01-02  1.0  3      País            Brasil

In [ ]:
DataFrame_02.tail(2)

   A          B    C  D        E              F
2  1 2021-01-02  1.0  3  Celular  (11)922332233
3  1 2021-01-02  1.0  3     País         Brasil

In [ ]:
DataFrame_02.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [ ]:
DataFrame_02.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [ ]:
DataFrame_02.values

array([[1, Timestamp('2021-01-02 00:00:00'), 1.0, 3, 'Email',
        'email@.email.com'],
       [1, Timestamp('2021-01-02 00:00:00'), 1.0, 3, 'Telefone',
        '(11)4455-4455'],
       [1, Timestamp('2021-01-02 00:00:00'), 1.0, 3, 'Celular',
        '(11)922332233'],
       [1, Timestamp('2021-01-02 00:00:00'), 1.0, 3, 'País', 'Brasil']],
      dtype=object)

In [ ]:
DataFrame_02.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [ ]:
DataFrame_01.sort_index(axis=1, ascending=False)

                   D         C         B         A
2021-01-01 -1.727486  1.221394 -1.188419  1.189776
2021-01-02  1.467141 -0.834335  0.409810  1.836365
2021-01-03 -0.071149  1.063351  0.981437 -0.078459
2021-01-04 -0.912932 -0.976037 -0.874464 -0.423498
2021-01-05 -1.331700  0.708346  0.885791  1.402493

In [ ]:
DataFrame_02.sort_values(by='E')

   A          B    C  D         E                 F
2  1 2021-01-02  1.0  3   Celular     (11)922332233
0  1 2021-01-02  1.0  3     Email  email@.email.com
3  1 2021-01-02  1.0  3      País            Brasil
1  1 2021-01-02  1.0  3  Telefone     (11)4455-4455

In [ ]:
DataFrame_01['A']

2021-01-01    1.189776
2021-01-02    1.836365
2021-01-03   -0.078459
2021-01-04   -0.423498
2021-01-05    1.402493
Freq: D, Name: A, dtype: float64

In [ ]:
DataFrame_01[0:3]

                   A         B         C         D
2021-01-01  1.189776 -1.188419  1.221394 -1.727486
2021-01-02  1.836365  0.409810 -0.834335  1.467141
2021-01-03 -0.078459  0.981437  1.063351 -0.071149

In [ ]:
DataFrame_01['20210101':'20210102']

                   A         B         C         D
2021-01-01  1.189776 -1.188419  1.221394 -1.727486
2021-01-02  1.836365  0.409810 -0.834335  1.467141

In [ ]:
DataFrame_01.loc['20210101']

A    1.189776
B   -1.188419
C    1.221394
D   -1.727486
Name: 2021-01-01 00:00:00, dtype: float64

In [ ]:
DataFrame_01.loc[:,['A','B']]

                   A         B
2021-01-01  1.189776 -1.188419
2021-01-02  1.836365  0.409810
2021-01-03 -0.078459  0.981437
2021-01-04 -0.423498 -0.874464
2021-01-05  1.402493  0.885791

In [ ]:
DataFrame_01.iloc[3]

A   -0.423498
B   -0.874464
C   -0.976037
D   -0.912932
Name: 2021-01-04 00:00:00, dtype: float64

In [ ]:
DataFrame_01.iloc[3:5,0:2]

                   A         B
2021-01-04 -0.423498 -0.874464
2021-01-05  1.402493  0.885791

In [ ]:
DataFrame_01[ DataFrame_01.A > 0 ]

                   A         B         C         D
2021-01-01  1.189776 -1.188419  1.221394 -1.727486
2021-01-02  1.836365  0.409810 -0.834335  1.467141
2021-01-05  1.402493  0.885791  0.708346 -1.331700

In [ ]:
DataFrame_01[ DataFrame_01 > 0 ]

                   A         B         C         D
2021-01-01  1.189776       NaN  1.221394       NaN
2021-01-02  1.836365  0.409810       NaN  1.467141
2021-01-03       NaN  0.981437  1.063351       NaN
2021-01-04       NaN       NaN       NaN       NaN
2021-01-05  1.402493  0.885791  0.708346       NaN

In [ ]:
DataFrame_03 = DataFrame_01.copy()
DataFrame_03

                   A         B         C         D
2021-01-01  1.189776 -1.188419  1.221394 -1.727486
2021-01-02  1.836365  0.409810 -0.834335  1.467141
2021-01-03 -0.078459  0.981437  1.063351 -0.071149
2021-01-04 -0.423498 -0.874464 -0.976037 -0.912932
2021-01-05  1.402493  0.885791  0.708346 -1.331700

In [ ]:
DataFrame_03['Nova_Coluna'] = ['abc', 'def', 'ghi', 'jkl', 'mno']
DataFrame_03

                   A         B         C         D Nova_Coluna
2021-01-01  1.189776 -1.188419  1.221394 -1.727486         abc
2021-01-02  1.836365  0.409810 -0.834335  1.467141         def
2021-01-03 -0.078459  0.981437  1.063351 -0.071149         ghi
2021-01-04 -0.423498 -0.874464 -0.976037 -0.912932         jkl
2021-01-05  1.402493  0.885791  0.708346 -1.331700         mno

In [ ]:
DataFrame_03[ DataFrame_03['Nova_Coluna'].isin(['abc', 'mno']) ]

                   A         B         C         D Nova_Coluna
2021-01-01  1.189776 -1.188419  1.221394 -1.727486         abc
2021-01-05  1.402493  0.885791  0.708346 -1.331700         mno

In [ ]:
 DataFrame_04 = pd.Series( [1,2,3,4,5,6],
                          index=pd.date_range('20210101', periods=6) )
 DataFrame_04

2021-01-01    1
2021-01-02    2
2021-01-03    3
2021-01-04    4
2021-01-05    5
2021-01-06    6
Freq: D, dtype: int64

In [ ]:
DataFrame_04.at[ dates[0], 'A'] = 0

In [ ]:
Lista = [ c for c in range(1,50000000) ]

In [ ]:
%time for i in Lista: pass

CPU times: user 1.85 s, sys: 0 ns, total: 1.85 s
Wall time: 1.87 s

In [ ]:
%time
for c in range(1, 50000000):
  pass
%time

CPU times: user 4 µs, sys: 0 ns, total: 4 µs
Wall time: 8.34 µs
CPU times: user 3 µs, sys: 0 ns, total: 3 µs
Wall time: 5.96 µs